Revit 2026 API

# TessellatedShapeBuilderClear Method

---

Erases all face set and clears the logs, if any.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Clear()
```
```vb
Public Sub Clear
```
```cpp
public:
void Clear()
```
```fsharp
member Clear : unit -> unit
```

This function can be safely called upon builder without an open face set.

#### Reference

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace